---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FbxLightEmitLineLength
source: html/b7e49183-ff2f-ede7-4e86-deeb345ce18d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FbxLightEmitLineLength Property

"Emit from Line Length"

## Syntax (C#)
```csharp
public static ForgeTypeId FbxLightEmitLineLength { get; }
```